IDEA StatiCa Open Model
Segment2D.EndPoint Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the endpoint of the segment.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Point2D EndPoint { get; set; }
Public Property EndPoint As Point2D
	Get
	Set
public:
property Point2D^ EndPoint {
	Point2D^ get ();
	void set (Point2D^ value);
}
Property Value
Type: Point2D
See Also
Reference
Segment2D Class
IdeaRS.OpenModel.Geometry2D Namespace